{
  "format": "layers-model",
  "generatedBy": "keras v2.12.0",
  "convertedBy": "TensorFlow.js Converter v4.5.0",
  "modelTopology": {
    "keras_version": "2.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_5",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 22],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "dense_25_input"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_25",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [null, 22],
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_26",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_15",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_27",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_5",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_16",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_28",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_17",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_29",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "rmse",
      "metrics": ["mae", "rmse", "mse"],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 9.999999747378752e-6,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_5/gamma",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/beta",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        { "name": "dense_25/kernel", "shape": [22, 64], "dtype": "float32" },
        { "name": "dense_25/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_26/kernel", "shape": [64, 64], "dtype": "float32" },
        { "name": "dense_26/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_27/kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "dense_27/bias", "shape": [256], "dtype": "float32" },
        { "name": "dense_28/kernel", "shape": [256, 64], "dtype": "float32" },
        { "name": "dense_28/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_29/kernel", "shape": [64, 1], "dtype": "float32" },
        { "name": "dense_29/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
